package javaBasics;

//  	java面向对象的三条主线:
//  	
//  	1.java类及类成员:---->属性,方法, 构造器(非常重要); ---->代码块, 内部类(频率较低 );
//  
//  	2.面向对象的三大特征:---->封装性,继承性,多态性,(抽象性)
//  
// 	3.其他关键字:this  super  final  static  abstract  interface  package  import...
//  
//  	人把大象装进冰箱:
//  	     面向过程:------->	强调功能行为,	------->以函数为单位,------->考虑怎么做
//  		1把冰箱门打开
//  		2抬起大象,塞进冰箱
//  		3.把冰箱门关闭
//  	    面向对象:------->	强调具备了功能的对象,------->	以类/对像为最小单位,------->考虑谁做.
//  		人{
// 			打开(冰箱){
// 				冰箱.打开();
// 			}
// 			抬起(大象){
// 				大象.进入(冰箱);
// 			}
// 			关闭(冰箱){
// 				冰箱.关闭
// 			}
//  		}
//  		冰箱{
//  				打开(){}
//  				关闭(){}
//  
//  		}
//  		大象{
// 				进入(冰箱){
// 					//进入冰箱的细节
// 				}
//  		}
public class Java14_OOP {

}
